######################################1###########################################
# 1. Серед методів строк знайти в документації той метод, який додасть
# декілька символів зліва від початку строки.

a = "aaa"
print(a.rjust(len(a)+2))

#######################################2##########################################
#Подивитись на скріншот №1 та розібратись в чому суть помилки
#SyntaxError: invalid syntax

b = 16
c = 5
result = b // c
remain = b % c
print(f"Ваше количество долларов {result:.2f},Ваша сдача {remain:.2f} грн")

# Між :.2f и наступною строкою немає пробілу після коми
# Також можливо, що помилка пов'язана з версією Python. F-рядки були введені в Python з версії 3.6
# Реалізація в попередніх версіях виглядає так:
print("Ваше количество долларов {:.2f},Ваша сдача {:.2f} грн".format(result, remain))
print("Ваше количество долларов %.2f,Ваша сдача %.2f грн" % (result, remain))

######################################4###########################################
#Написати програму, яка розраховує індекс маси тіла якщо користувач може ввести
# значення ваги і зросту у різних системах виміру(по 2 на кожну)

choice = input("Выберите систему измерения: 1 - метрическая, 2 - имперская(футы). Ваш выбор: ")

if choice == "1":
    weight = float(input("Введите массу тела в килограммах: "))
    height = float(input("Введите рост в метрах: "))
    bmi = weight / (height ** 2)
    print("Индекс масы тела:", bmi)
elif choice == "2":
    weight = float(input("Введите массу тела в фунтах: "))
    height = float(input("Введите рост в дюймах: "))
    bmi = (weight * 703) / (height ** 2)
    print("Индекс масы тела:", bmi)
else:
    print("Ошибка")
