# 0) Пользователь воодит пароль - ми кажемо чи беспечний цей пароль чи ні.
# Пароль беспечний, якщо він довший за 12 символів.
# Має 1 букву в верхньому регистрі, 1 в нижньому, 1 цифру, 1 спецсимвол(?/!@)

password = input("Введіть пароль, що відповідає вимогам: ")

if len(password) <= 12:
    print("Пароль не безпечний: недостатня довжина")
if not any(char.isupper() for char in password):
    print("Пароль не безпечний: відсутня буква в верхньому регістрі")
if not any(char.islower() for char in password):
    print("Пароль не безпечний: відсутня буква в нижньому регістрі")
if not any(char.isdigit() for char in password):
    print("Пароль не безпечний: відсутні цифри")
if not any(char in ('?', '/', '!', '@') for char in password):
    print("Пароль не безпечний: відсутній спецсимвол")
else:
    print(f"Пароль безпечний. Ваш пароль: {password}")
