with open("home_work.txt", "w") as hw_file:
    hw_file.write("Літо — час, коли більшість людей відпочиває на морі або в горах."
                  "\nВідпустка дає можливість збільшити кількість приємних спогадів та надихнути на нові звершення."
                  "\n123456789"
                  "\nГірські вершини завжди привертали людей своєю магією."
                  "\nПід час походів у гори ви можете насолоджуватися неймовірними краєвидами та долати власні межі."
                  "\nЛіто це найкраща можливість вперше пізнати гори."
                  "\n@#$%test !@_&tes test"
                  "\nНе забувайте жити своє життя.")
